Revit 2027 API
ColorOptions.PreselectionColor Property
 The color of the current canvas theme used to highlight candidates for selection before they are selected.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color PreselectionColor { get; set; }
Public Property PreselectionColor As Color
	Get
	Set
public:
property Color^ PreselectionColor {
	Color^ get ();
	void set (Color^ value);
}
member PreselectionColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ColorOptions Class
Autodesk.Revit.DB Namespace